---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughRiserCurves
source: html/8b7c8bb3-aa1c-30a8-d1b1-c7ae2123068b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughRiserCurves Property

Boundaries (chains of one or more Boundary Lines) must be connected by at least two Riser Lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairNotEnoughRiserCurves { get; }
```